
Функция ИННВерен(ИНН, Тип)Экспорт
	Результат = Новый Структура("Верен,ТекстОшибки",Истина,"");
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Возврат Результат;
	КонецЕсли;
	
	КорректнаяДлинаИНН = КорректнаяДлинаИНН(Тип);
	
	Если КорректнаяДлинаИНН <> СтрДлина(ИНН) Тогда
		Результат.Верен = Ложь;
		Результат.ТекстОшибки = "Некорректная длина ИНН!";
		Возврат Результат;
	КонецЕсли;
	
	ТолькоЦифры = ТолькоЦифры(ИНН);

	
	Если Не ТолькоЦифры Тогда
		Результат.Верен = Ложь;
		Результат.ТекстОшибки = "Недопустимые символы!";
		Возврат Результат;

	КонецЕсли;
	
	Если СтрДлина(ИНН)=10 Тогда
		СтрокаМножителей ="2,4,10,3,5,9,4,6,8,0";
		Множители = СтрРазделить(СтрокаМножителей,",");
		КонтрольнаяСумма =0;
		НомерСимвола =0;
		Для Каждого Множитель Из Множители Цикл
			НомерСимвола = НомерСимвола+1;
			СимволИНН = Сред(ИНН,НомерСимвола,1);
			КонтрольнаяСумма=КонтрольнаяСумма+Множитель*СимволИНН;
		КонецЦикла;
		КонтрольныйРазряд = КонтрольнаяСумма%11;
		Если КонтрольныйРазряд =10 Тогда;
			КонтрольныйРазряд =0;
		КонецЕсли;  
		
		Если Строка(КонтрольныйРазряд)<>Сред(ИНН,10,1) Тогда
		Результат.Верен = Ложь;
		Результат.ТекстОшибки = "Не совпадает контрольный разряд ИНН!";
		Возврат Результат;
		КонецЕсли;	
	КонецЕсли;
	
	   Если СтрДлина(ИНН)=12 Тогда
		СтрокаМножителей ="7,2,4,10,3,5,9,4,6,8,0";
		Множители = СтрРазделить(СтрокаМножителей,",");
		КонтрольнаяСумма =0;
		НомерСимвола =0;
		Для Каждого Множитель Из Множители Цикл
			НомерСимвола = НомерСимвола+1;
			СимволИНН = Сред(ИНН,НомерСимвола,1);
			КонтрольнаяСумма=КонтрольнаяСумма+Множитель*СимволИНН;
		КонецЦикла;
		КонтрольныйРазряд = КонтрольнаяСумма%11;
		Если КонтрольныйРазряд >9 Тогда;
			КонтрольныйРазряд =КонтрольныйРазряд%10;
		КонецЕсли;  
		
		СтрокаВторыхМножителей ="3,7,2,4,10,3,5,9,4,6,8,0";
		ВторыеМножители = СтрРазделить(СтрокаВторыхМножителей,",");
		ВтораяКонтрольнаяСумма =0;
		НомерСимвола =0;
		Для Каждого ВторойМножитель Из ВторыеМножители Цикл
			НомерСимвола = НомерСимвола+1;
			СимволИНН = Сред(ИНН,НомерСимвола,1);
			ВтораяКонтрольнаяСумма=ВтораяКонтрольнаяСумма+ВторойМножитель*СимволИНН;
		КонецЦикла;
		ВторойКонтрольныйРазряд = ВтораяКонтрольнаяСумма%11;
		Если ВторойКонтрольныйРазряд >9 Тогда;
			ВторойКонтрольныйРазряд = ВторойКонтрольныйРазряд%10;
		КонецЕсли;  

		
		Если Строка(КонтрольныйРазряд)<>Сред(ИНН,11,1)ИЛИ Строка(ВторойКонтрольныйРазряд)<>Сред(ИНН,12,1) Тогда
			Результат.Верен = Ложь;
		Результат.ТекстОшибки = "Не совпадает контрольный разряд ИНН!";
		Возврат Результат;
		КонецЕсли;	
	КонецЕсли;
	Результат.Верен = Истина;
	Результат.ТекстОшибки = "";
	Возврат Результат;	
	КонецФункции

Функция ТолькоЦифры(ИНН)
	
	Перем НомерСимволаИНН, СимволИНН, ТолькоЦифры, Цифры;
	
	ТолькоЦифры = Истина;
	Цифры ="0123456789";
	Для НомерСимволаИНН =1 По СтрДлина(ИНН) Цикл 
		СимволИНН = Сред(ИНН,НомерСимволаИНН,1);
		Если СтрНайти(Цифры, СимволИНН)=0 Тогда
			ТолькоЦифры = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифры;

КонецФункции

Функция КорректнаяДлинаИНН(Тип)
	
	Перем КорректнаяДлинаИНН;
	
	Если Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо")Тогда
		КорректнаяДлинаИНН = 10;
	Иначе
		КорректнаяДлинаИНН = 12;
	КонецЕсли;
	Возврат КорректнаяДлинаИНН;
	
КонецФункции
