
&НаСервере
Процедура ПересчитатьНаСервере()
	Выборка = Документы.ПоступлениеТоваровИУслуг.Выбрать(Объект.ДатаНачалаПериода,Объект.ДатаЗавершенияПериода);
	Пока Выборка.Следующий() Цикл
		Поступление = Выборка.ПолучитьОбъект();
		Для Каждого СтрокаТовары Из Поступление.Товары Цикл
			СтрокаТовары.Сумма = СтрокаТовары.Цена*СтрокаТовары.Количество;
		КонецЦикла;
		Если Поступление.Проведен Тогда
			Режим =РежимЗаписиДокумента.Проведение;
		Иначе
			Режим = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		Поступление.Записать(Режим);
	КонецЦикла;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьНаСервере();
КонецПроцедуры
