
&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)

ПодключитьОбработчикОжидания("УстановитьСписокГрупп",0.2,Истина);
УстановитьСписокГрупп();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокГрупп()
	
	Перем НайденныйЭлементОтбора, ПолеРодитель, ЭлементОтбора, ЭлементыОтбора;
	
	ПолеРодитель = Новый ПолеКомпоновкиДанных("Родитель");
	НайденныйЭлементОтбора = Неопределено;
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеРодитель Тогда
			НайденныйЭлементОтбора = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлементОтбора = Неопределено Тогда
		НайденныйЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НайденныйЭлементОтбора.ЛевоеЗначение = ПолеРодитель;
		НайденныйЭлементОтбора.Использование = Истина;
		НайденныйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	НайденныйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НайденныйЭлементОтбора.ПравоеЗначение = Элементы.СписокГрупп.ТекущаяСтрока;
	
КонецПроцедуры

