
&НаКлиенте
Процедура СлучайныйПароль(Команда)
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	СгенерированныйПароль = "";
	СимволыПароля = "0123456789абвгдежзиклмнопрстуфхцчшщьъэюя";
	Для Н =1 по 6 Цикл
		СгенерированныйПароль = СгенерированныйПароль+Сред(СимволыПароля,ГСЧ.СлучайноеЧисло(1,40),1);
	КонецЦикла;
	Пароль = СгенерированныйПароль;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);

Если Пользователь <> Неопределено Тогда
	ИмяДляВхода = Пользователь.Имя;
	Если Пользователь.ПарольУстановлен Тогда
		Пароль = "Установлен";
	КонецЕсли;
	ВходРазрешен = Истина;
ИначеЕсли Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Или Пользователь = Неопределено Тогда 
	ИмяДляВхода = "";
	Пароль = "";
	ВходРазрешен = Ложь;
КонецЕсли;
КонецПроцедуры    


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) Тогда
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
		ИмяДляВхода = Пользователь.Имя;
		Пароль = Пользователь.Пароль;
		ВходРазрешен = Пользователь.АутентификацияСтандартная;
		Пользователь.Записать();
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) И ВходРазрешен = Истина Тогда
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.АутентификацияСтандартная = ВходРазрешен;
		НовыйПользователь.Имя = ИмяДляВхода;
		НовыйПользователь.ПолноеИмя = ТекущийОбъект.Наименование;
		НовыйПользователь.Пароль = Пароль;
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
		НовыйПользователь.Записать();
		ТекущийОбъект.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПосмотретьПароль(Команда)
	Если Элементы.Пароль.РежимПароля = Истина Тогда
		Элементы.Пароль.РежимПароля = Ложь;
		Элементы.ПосмотретьПароль.Заголовок = "Скрыть пароль";
	ИначеЕсли Элементы.Пароль.РежимПароля = Ложь Тогда
		Элементы.Пароль.РежимПароля = Истина;
		Элементы.ПосмотретьПароль.Заголовок = "Посмотреть пароль";
	КонецЕсли;
		
		
КонецПроцедуры

