
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСуммуСтроки();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки()
		
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
    ТекущиеДанныеТаблицы.Сумма = ТекущиеДанныеТаблицы.Количество*ТекущиеДанныеТаблицы.Цена;
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	СортироватьПоВозрастанию = Не СортироватьПоВозрастанию;
	Если СортироватьПоВозрастанию = Истина Тогда
		Объект.Товары.Сортировать("Сумма Возр");
		Элементы.ФормаСортироватьПоСумме.Заголовок = "Сортировать по возрастанию";
	Иначе
		Объект.Товары.Сортировать("Сумма Убыв");
		Элементы.ФормаСортироватьПоСумме.Заголовок = "Сортировать по убыванию";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.Основное Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаТовары;
	КонецЕсли;
	ДоступностьКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.Основное;
	КонецЕсли;
	ДоступностьКоманд();
	
КонецПроцедуры 

&НаКлиенте
Процедура СтраницыФормыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ДоступностьКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьКоманд()
	
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
		Элементы.ФормаНазад.Доступность=Истина;
		Элементы.ФормаДалее.Доступность=Ложь;
	ИначеЕсли Элементы.СтраницыФормы.ТекущаяСтраница=Элементы.Основное Тогда
		Элементы.ФормаНазад.Доступность=Ложь;
		Элементы.ФормаДалее.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком", , Элементы.Товары);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокаТаблицы = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
		
	КонецЦикла;

КонецПроцедуры

		