&НаКлиенте
Процедура СписокКонтрагентовПриАктивизацииСтроки(Элемент)

ПодключитьОбработчикОжидания("УстановитьСписокКонтрагентов",0.2,Истина);
УстановитьСписокКонтрагентов();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокКонтрагентов()
	
	Перем НайденныйЭлементОтбора, ПолеВладелец, ЭлементОтбора, ЭлементыОтбора;
	
	ПолеВладелец = Новый ПолеКомпоновкиДанных("Владелец");
	НайденныйЭлементОтбора = Неопределено;
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеВладелец Тогда
			НайденныйЭлементОтбора = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлементОтбора = Неопределено Тогда
		НайденныйЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НайденныйЭлементОтбора.ЛевоеЗначение = ПолеВладелец;
		НайденныйЭлементОтбора.Использование = Истина;
		НайденныйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	НайденныйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НайденныйЭлементОтбора.ПравоеЗначение = Элементы.СписокКонтрагентов.ТекущаяСтрока;
	
КонецПроцедуры

